-- phpMyAdmin SQL Dump
-- version 4.5.4.1deb2ubuntu2
-- http://www.phpmyadmin.net
--
-- Хост: localhost
-- Время создания: Янв 18 2018 г., 11:26
-- Версия сервера: 5.7.20-0ubuntu0.16.04.1
-- Версия PHP: 7.0.22-0ubuntu0.16.04.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `blog`
--

-- --------------------------------------------------------

--
-- Структура таблицы `blog`
--

CREATE TABLE `blog` (
  `id` int(11) NOT NULL,
  `title` varchar(255) CHARACTER SET utf8 NOT NULL,
  `content` text CHARACTER SET utf8 NOT NULL,
  `date` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `blog`
--

INSERT INTO `blog` (`id`, `title`, `content`, `date`) VALUES
(20, 'Земля', 'Планетарні характеристики Земля обертається навколо Сонця еліптичною орбітою (дуже близькою до колової) із середньою швидкістю 29 785 м/с на середній відстані 149,6 млн км із періодом, що приблизно дорівнює 365,24 доби (зоряний рік). Земля має супутник — Місяць, який обертається навколо Землі на середній відстані 384 400 км. Нахил земної осі до площини екліптики становить 66°33′22″. Період обертання планети навколо своєї осі 23 год 56 хв 4,1 с. Обертання навколо своєї осі викликає зміну дня і ночі, а нахил осі до екліптики разом із обертанням навколо Сонця — зміну пір року.  Форма Землі — геоїд. Середній радіус Землі становить 6371,032 км, екваторіальний — 6378,16 км, полярний — 6356,777 км. Площа поверхні земної кулі 510 млн км², об\'єм — 1,083·1012 км³, середня густина — 5518 кг/м³. Маса Землі становить 5976·1021 кг. Земля має магнітне і тісно пов\'язане з ним електричне поля[джерело?]. Гравітаційне поле Землі зумовлює її близьку до сферичної форму й існування атмосфери.  За сучасними космогонічними уявленнями Земля утворилася приблизно 4,7 млрд років тому з розсіяної в протосонячній системі газопилової речовини. Внаслідок диференціації речовини Землі, під дією гравітаційного поля, в умовах розігріву земних надр виникли і розвилися різні за хімічним складом, агрегатним станом і фізичними властивостями оболонки — геосфери: ядро, мантія, земна кора, гідросфера, атмосфера, магнітосфера. У складі Землі переважає залізо (34,6 %), кисень (29,5 %), кремній (15,2 %), магній (12,7 %)[джерело?]. Земна кора, мантія і внутрішня частина ядра тверді (зовнішня частина ядра вважається рідкою)[джерело?]. Від поверхні Землі до центру зростають тиск, густина й температура. Тиск у центрі планети 3,6·1011 Па, густина приблизно 12,5·10³ кг/м³, температура в діапазоні від 5000 до 6000 °C. Основні типи земної кори — материкова та океанічна, у перехідній зоні від материка до океану розвинута кора проміжної будови.', '2017-12-18'),
(21, 'Марс', 'Загальна характеристика[ред. • ред. код] Марс — планета земного типу з розрідженою атмосферою. На Марсі є метеоритні кратери, як на Місяці, вулкани, долини і пустелі, подібні до земних. Тут розташована гора Олімп (22 456 м), найвища відома гора в Сонячній системі, і Долини Марінера — величезна рифтоподібна система каньйонів[1]. На додаток до особливостей — період обертання Марса і сезонні цикли також подібні до земних.  Марс — невелика планета, більша за Меркурій, але майже вдвічі менша від Землі за діаметром. Марс має екваторіальний радіус 3396 км і середній полярний радіус 3379 км (обидва значення точно визначені космічним апаратом «Mars Global Surveyor», який почав свою місію на орбіті навколо планети 1999 року). Маса Марса становить 6,418×1023 кг, що вдесятеро менше за масу Землі, а прискорення вільного падіння на його поверхні — 3,72 м/с². Це означає, що об\'єкти на Марсі важать лише третину своєї земної ваги.', '2017-12-18'),
(22, 'Венера', 'Вене́ра — друга планета Сонячної системи. Період обертання навколо Сонця — 224,7 земних діб. Названа на честь Венери, богині любові з римського пантеону. Це єдина з восьми основних планет Сонячної системи, яка отримала назву на честь жіночого божества. За розміром майже така сама, як Земля.  Венера — внутрішня планета, і на земному небосхилі не віддаляється від Сонця далі 48°. Венера — третій за яскравістю об\'єкт на небі; її блиск поступається лише блиску Сонця та Місяця. Належить до планет, відомих людству з найдавніших часів.', '2017-12-18'),
(23, 'Плутон', 'Плуто́н (134340 Pluto) — крупнейшая известная карликовая планета Солнечной системы[9], транснептуновый объект и десятое по массе (без учёта спутников) небесное тело, обращающееся вокруг Солнца — после восьми планет и Эриды[10][11][12]. Первоначально Плутон причисляли к обычным планетам, но сейчас он считается карликовой планетой и самым крупным объектом в поясе Койпера[9].  Как и большинство тел пояса Койпера, Плутон состоит в основном из камня и льда и он относительно мал: его масса меньше массы Луны примерно в 6 раз, а объём — примерно в 3 раза. Площадь Плутона (17,7 млн км²) немногим больше площади России (17,1 млн км²). У орбиты Плутона большой эксцентриситет и большой наклон к плоскости эклиптики.  Из-за эксцентричности орбиты Плутон то приближается к Солнцу на расстояние 29,7 а. е. (4,4 млрд км), оказываясь к нему ближе Нептуна, то удаляется на 49,3 а. е. (7,4 млрд км). Плутон и его крупнейший спутник Харон, открытый в 1978 году, часто рассматриваются как двойная планета, поскольку барицентр их системы находится вне обоих объектов[13]. Международный астрономический союз (МАС) заявил о намерении дать формальное определение для двойных карликовых планет, а до этого момента Харон классифицируется как спутник Плутона[14][15]. У Плутона есть четыре меньших спутника:', '2017-12-18'),
(24, 'Нептун', 'Непту́н — восьмая планета Солнечной системы. Нептун также является четвёртой по диаметру и третьей по массе планетой. Масса Нептуна в 17,2 раза, а диаметр экватора в 3,9 раза больше земных[10]. Планета была названа в честь римского бога морей. Её астрономический символ Neptune symbol.svg — стилизованная версия трезубца Нептуна.  Обнаруженный 23 сентября 1846 года[1], Нептун стал первой планетой, открытой благодаря математическим расчётам, а не путём регулярных наблюдений. Обнаружение непредвиденных изменений в орбите Урана породило гипотезу о неизвестной планете, гравитационным возмущающим влиянием которой они и обусловлены. Нептун был найден в пределах предсказанного положения. Вскоре был открыт и его спутник Тритон, однако остальные 13 спутников, известные ныне, были неизвестны до XX века. Нептун был посещён лишь одним космическим аппаратом, «Вояджером-2», который пролетел вблизи от планеты 25 августа 1989 года.', '2017-12-18'),
(25, 'Уран', 'Ура́н — планета Солнечной системы, седьмая по удалённости от Солнца, третья по диаметру и четвёртая по массе. Была открыта в 1781 году английским астрономом Уильямом Гершелем и названа в честь греческого бога неба Урана.  Уран стал первой планетой, обнаруженной в Новое время и при помощи телескопа[12]. Его открыл Уильям Гершель 13 марта 1781 года[13], тем самым впервые со времён античности расширив границы Солнечной системы в глазах человека. Несмотря на то, что порой Уран различим невооружённым глазом, более ранние наблюдатели принимали его за тусклую звезду[14].  В отличие от газовых гигантов — Сатурна и Юпитера, состоящих в основном из водорода и гелия, в недрах Урана и схожего с ним Нептуна отсутствует металлический водород, но зато много льда в его высокотемпературных модификациях. По этой причине специалисты выделили эти две планеты в отдельную категорию «ледяных гигантов». Основу атмосферы Урана составляют водород и гелий. Кроме того, в ней обнаружены следы метана и других углеводородов, а также облака изо льда, твёрдого аммиака и водорода. Это самая холодная планетарная атмосфера Солнечной системы с минимальной температурой в 49 К (−224 °C). Полагают, что Уран имеет сложное слоистое строение облаков, где вода составляет нижний слой, а метан — верхний[11]. Недра Урана состоят в основном изо льдов и горных пород.', '2017-12-18');

-- --------------------------------------------------------

--
-- Структура таблицы `comment`
--

CREATE TABLE `comment` (
  `id_comment` int(11) NOT NULL,
  `name` varchar(255) CHARACTER SET utf8 NOT NULL,
  `comment` text CHARACTER SET utf8 NOT NULL,
  `id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `comment`
--

INSERT INTO `comment` (`id_comment`, `name`, `comment`, `id`) VALUES
(1, 'kmk ', 'gyguiljk', 4),
(2, 'fgh', 'sfh', 15);

-- --------------------------------------------------------

--
-- Структура таблицы `user`
--

CREATE TABLE `user` (
  `id` int(11) NOT NULL,
  `name` varchar(255) CHARACTER SET utf8 NOT NULL,
  `email` varchar(255) CHARACTER SET utf8 NOT NULL,
  `password` varchar(255) CHARACTER SET utf8 NOT NULL,
  `permission` tinyint(1) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `user`
--

INSERT INTO `user` (`id`, `name`, `email`, `password`, `permission`) VALUES
(1, 'Tolik', 'Matveycom@rambler.ru', 'Tolyanu4', 1),
(2, 'Tolik', 'Tolik@rambler.ru', 'Tolyanu4', NULL);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `blog`
--
ALTER TABLE `blog`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `comment`
--
ALTER TABLE `comment`
  ADD PRIMARY KEY (`id_comment`);

--
-- Индексы таблицы `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `blog`
--
ALTER TABLE `blog`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;
--
-- AUTO_INCREMENT для таблицы `comment`
--
ALTER TABLE `comment`
  MODIFY `id_comment` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
--
-- AUTO_INCREMENT для таблицы `user`
--
ALTER TABLE `user`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
